In [50]:
# 데이터프레임의 행과 열을 바꿈 ; 전체 행렬

import pandas as pd

exam_data = {
    '이름' : ['서준', '우현', '인아'],
    '수학' : [90, 90, 100],
    '영어' : [98, 99, 88]
}

df = pd.DataFrame(exam_data)
print(df)


df.set_index('이름', inplace=True)
print(df)

   이름   수학  영어
0  서준   90  98
1  우현   90  99
2  인아  100  88
0
1
2
     수학  영어
이름
서준   90  98
우현   90  99
인아  100  88

In [5]:
df = df.T
print(df)

     0   1    2
이름  서준  우현   인아
수학  90  90  100
영어  98  99   88

In [32]:
# reindex(새로운 인덱스 배열) : 기졵의 자료 변경 안함, 새로운 데이터프레임 반환

dict_data = {
    'c0': [1,2,3], 'c1': [4,5,6], 'c2': [7,8,9], 'c3': [10,11,12]}

df = pd.DataFrame(dict_data, index = ['r1', 'r2', 'r3'])
df

    c0  c1  c2  c3
r1   1   4   7  10
r2   2   5   8  11
r3   3   6   9  12

In [25]:
# index를 ['r0','r1','r2','r3','r4']

new_index = ['r0','r1','r2','r3','r4']
ndf = df.reindex(new_index) # 존재하지 않는 인덱스의 값은 Nan으로 채워 짐
print(ndf)

# 존재하지 않는 인덱스의 값은 0으로 채워 줌
ndf1 = df.reindex(new_index, fill_value = 0)
ndf1

# method -> ffill 이전자료 복사(front, bfill : 이후 자료 복사(back)
ndf2 = df.reindex(new_index, method = 'bfill')
ndf2

     c0   c1   c2    c3
r0  NaN  NaN  NaN   NaN
r1  1.0  4.0  7.0  10.0
r2  2.0  5.0  8.0  11.0
r3  3.0  6.0  9.0  12.0
r4  NaN  NaN  NaN   NaN

     c0   c1   c2    c3
r0  1.0  4.0  7.0  10.0
r1  1.0  4.0  7.0  10.0
r2  2.0  5.0  8.0  11.0
r3  3.0  6.0  9.0  12.0
r4  NaN  NaN  NaN   NaN

In [38]:
# reset_index() : 인덱스 초기화

print(df)
print(df.reset_index()) # 기존의 인덱스가 컬럼으로 변환, 인덱스 초기화
df.reset_index(drop=True) # 기존의 인덱스을 삭제, 인덱스 초기화
df

    c0  c1  c2  c3
r1   1   4   7  10
r2   2   5   8  11
r3   3   6   9  12
  index  c0  c1  c2  c3
0    r1   1   4   7  10
1    r2   2   5   8  11
2    r3   3   6   9  12

    c0  c1  c2  c3
r1   1   4   7  10
r2   2   5   8  11
r3   3   6   9  12

In [41]:
# 인덱스를 기준으로 정렬
df.sort_index(ascending=False) # ascending = True 로 설정되어 있음

    c0  c1  c2  c3
r3   3   6   9  12
r2   2   5   8  11
r1   1   4   7  10

In [45]:
# 컬럼을 기준으로 정렬
df.loc['r1', 'c0'] = 2
df.loc['r1', 'c2'] = 14
df.sort_values(by = ['c0', 'c1'], ascending=False)

    c0  c1  c2  c3
r3   3   6   9  12
r1   2   9  14  10
r2   2   5   8  11

In [47]:
# 인덱스를 설정 df.index = []
# 컬럼명을 설정 df.columns = []
# 인덱스의 이름을 변경 df.rename({기존 인덱스 : 새로운 인덱스, ...}, inplace=)
# 컬럼명을 변경 df.rename({기존컬럼: 새로운 컬럼}, inplace=)
# 인덱스를 삭제 df.drop([인덱스명], axis = 0)
# 새로운 인덱스 이름 부여 : ndf = df.reindex(new_index, [fill.value], method=)
# 인덱스 제거 df.reset_index([drop=Ture]) 인덱스를 컬럼으로 변환 하지 않음
# 인덱스 기준으로 정렬 df.sort_index([acending])
# 컬럼 기준으로 정렬 df.sort_values(by = [컬럼명])

In [ ]:
# 시리즈 연상 : 시리즈 + * / - 사칙연산 가능
# 1. 인덱스로 정렬
# 2. 매칭되는 값에 대해 연산, Nan이 있으면 결과는 Nan
# 3. 결과 리턴 -> 인덱스로 정렬된 상태

In [56]:
student = pd.Series({'국어': 100, '수학': 90, '영어': 90})

print(student)

print(student + 100)
print(student / 100)
print(student - 50)

국어    100
수학     90
영어     90
dtype: int64
국어    200
수학    190
영어    190
dtype: int64
국어    1.0
수학    0.9
영어    0.9
dtype: float64
국어    50
수학    40
영어    40
dtype: int64

In [60]:
# 시리즈 연산
student1 = pd.Series({'국어': 100, '수학': 90, '영어': 90})
student2 = pd.Series({'수학': 100, '국어': 90, '영어': 90, '과학': 88})

print(student1 + student2)

과학      NaN
국어    190.0
수학    190.0
영어    180.0
dtype: float64

In [61]:
# 시리즈 연산
import numpy as np
student1 = pd.Series({'국어': np.nan, '수학': 90, '영어': 90})
student2 = pd.Series({'수학': 100, '국어': 90, '영어': 90, '과학': 88})

print(student1 + student2)

과학      NaN
국어      NaN
수학    190.0
영어    180.0
dtype: float64

In [64]:
# 시리즈 연산 메서드 : 시리즈.add(시리즈1, fill_value=0)
print(student1.add(student2, fill_value=0))
print(student1.sub(student2, fill_value=0))
print(student1.mul(student2, fill_value=0))
print(student1.div(student2, fill_value=0))

과학     88.0
국어     90.0
수학    190.0
영어    180.0
dtype: float64
과학   -88.0
국어   -90.0
수학   -10.0
영어     0.0
dtype: float64
과학       0.0
국어       0.0
수학    9000.0
영어    8100.0
dtype: float64
과학    0.0
국어    0.0
수학    0.9
영어    1.0
dtype: float64

In [66]:
# 데이터프레임 연산(+,-,*,/)
# seaborn에서 dataset 가져오기
import seaborn as sns

In [76]:
titanic = sns.load_dataset('titanic')
titanic.head()# haed는 5프레이만 보여줌
titanic.columns # age, fare 컬럼의 자료만 검색
df = titanic.loc[:, ['age', 'fare']]

In [77]:
print(df.head(),'\n\n', (df + 10).head())

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

     age     fare
0  32.0  17.2500
1  48.0  81.2833
2  36.0  17.9250
3  45.0  63.1000
4  45.0  18.0500

In [78]:
print(df.head(),'\n\n', (df + 10).tail())

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

       age   fare
886  37.0  23.00
887  29.0  40.00
888   NaN  33.45
889  36.0  40.00
890  42.0  17.75

In [85]:
add_df = df.add(0, fill_value=0)
add_df.tail()

      age   fare
886  27.0  13.00
887  19.0  30.00
888   0.0  23.45
889  26.0  30.00
890  32.0   7.75

In [ ]:
# seaborn 에서 titaic 데이터셋 자료를 가져와서
# 'clss', 'sex', 'age', 'alive' 컬럼과  0행부터 100행까지만 자료가지고 올 것
# df에 저장

In [116]:
df = titanic.loc[0 : 100, ['class', 'sex', 'age', 'alive']]
# add_df1 = df.add(0, fill_value = 0)
# print(add_df1)
# print(df.head(20))
print(df)
df.set_index('class', inplace=True)
print(df)
df.sort_index().head()

      class     sex   age alive
0     Third    male  22.0    no
1     First  female  38.0   yes
2     Third  female  26.0   yes
3     First  female  35.0   yes
4     Third    male  35.0    no
..      ...     ...   ...   ...
96    First    male  71.0    no
97    First    male  23.0   yes
98   Second  female  34.0   yes
99   Second    male  34.0    no
100   Third  female  28.0    no

[101 rows x 4 columns]
           sex   age alive
class
Third     male  22.0    no
First   female  38.0   yes
Third   female  26.0   yes
First   female  35.0   yes
Third     male  35.0    no
...        ...   ...   ...
First     male  71.0    no
First     male  23.0   yes
Second  female  34.0   yes
Second    male  34.0    no
Third   female  28.0    no

[101 rows x 3 columns]

          sex   age alive
class
First  female   NaN   yes
First    male   NaN    no
First    male   NaN   yes
First    male  65.0    no
First  female  49.0   yes